//
// СУ "Св. Климент Охридски"
// Факултет по математика и информатика
// Курс Увод в програмирането 2020/21
// Контролно 1
// 2020-11-29
//
// Начален час: 09:00
// Име: Даниел Даниел Иванов
// ФН: 45792
// Специалност: Информатика
// Курс: Първи
// Административна група: 4
// Използван компилатор: G++
//

#include <iostream>

using namespace std;



//0 0 0 1
//0 0 0 1
//0 0 1 0

int main(){ 
    bool a1,a2,a3,a4;
    bool b1,b2,b3,b4;
    bool result0,result1,result2,result3,result4;
    cin >> a1 >> a2 >> a3 >> a4;
    cin >> b1 >> b2 >> b3 >> b4;

    // if (a4 & b4 == 0){              //Това ми помогна, за да преосмисля какво точно трябва да напиша, затова го оставям
    //    result4 = (a4&b4);
    // }
    // else if(a4&b4 == 1){ 
    //     result4 = (!a4);
    // }
    // else {
    //     result4 = a4 | b4;
    // }

    //1^1 = 0
    //0^0 = 0
    //1^0 = 1
    //0^1 = 1

    
    result4 = (((a4 & b4) && 0) && (a4 & b4)) || (((a4 & b4) && 1) && (!a4))  || ((!(a4 & b4)) && (a4 | b4));
    result3 = (a4 & b4 & 1) ^ ((a3 & b3 & 0) && (a3 & b3) || (a3 & b3 & 1) && (!a3)  || (!(a3 & b3)) && (a3 | b3));
    result2 = ((a4 & b4 & 1) && (a3|b3))  ^   ((a2 & b2 & 0) && (a2 & b2) || (a2 & b2 & 1) && (!a2)  || (!(a2 & b2)) && (a2 | b2));
    result1 = ((a4 & b4 & 1) && (a3|b3) && (a2|b2))   ^   ((a1 & b1 & 0) && (a1 & b1) || (a1 & b1 & 1) && (!a1)  || (!(a1 & b1)) && (a1 | b1));
    result0 = ((a4 & b4 & 1) && (a3|b3) && (a2|b2) && (a1|b1));
    //  1 0 0 1       1 0 0 0       0 0 0 0
    //  0 1 1 1       0 0 0 1       1 0 0 0
    //1 0 0 0 0     0 1 0 0 1     0 1 0 0 0

    cout << result0 << result1 << result2 << result3 << result4; 
    return 0;
}